Revit 2024 API
AnalyticalPowerSourceData Class
 Represents the data and parameters of analytical power source node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalPowerSourceData : AnalyticalDistributionNodePropertyData
Visual Basic
Public Class AnalyticalPowerSourceData _
	Inherits AnalyticalDistributionNodePropertyData
Visual C++
public ref class AnalyticalPowerSourceData : public AnalyticalDistributionNodePropertyData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
See Also
AnalyticalPowerSourceData Members
Autodesk.Revit.DB.Electrical Namespace